'''1. Написать функцию is_prime, принимающую 1 аргумент — число от 0 до 1000,
и возвращающую True, если оно простое, и False - иначе'''

'''2. Написать функцию square, принимающую 1 аргумент — сторону квадрата, и возвращающую 3 значения
с помощью кортежа : периметр квадрата, площадь квадрата и диагональ квадрата'''

'''3. Написать функцию arithmetic, принимающую 3 аргумента: первые 2 - числа, третий - операция, которая должна быть 
произведена над ними. Если третий аргумент +, сложить их; если —, то вычесть; * — умножить; / — разделить 
(первое на второе). В остальных случаях вернуть строку "Неизвестная операция".'''

'''4. Напишите функцию, которая проверяет, является ли строка палиндромом. 
Палиндром — это слово или фраза, которые одинаково читаются слева направо и справа налево.'''